# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Figures Article lfmm
#+AUTHOR: Kévin CAYE
#+LANGUAGE: en
#+STARTUP: overview indent inlineimages logdrawer
#+OPTIONS: H:0 email:nil creator:nil timestamp:nil skip:nil toc:nil ^:nil
#+TAGS: noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS
#+SEQ_TODO: TODO(t!) STARTED(s!) WAITING(w!) RUNNING(r!) DEBUG(g!) APPT(a!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[textheight=9.033757in,textwidth=6.022505in]{geometry}
#+LATEX_HEADER: \usepackage[table]{xcolor}% http://ctan.org/pkg/xcolor


#+PROPERTY: header-args :exports none :eval no-export :session *R* :dir ~/Projects/Thesis/3Article/


#+BEGIN_EXPORT latex
% \begin{tabular}{ll}
  % textwidth in pt: \the\textwidth \\
  % textheight in pt: \the\textheight \\
% \end{tabular}
#+END_EXPORT
** DONE Table1
CLOSED: [2017-11-15 mer. 18:45]
:LOGBOOK:
- State "DONE"       from              [2017-11-15 mer. 18:45]
- Note taken on [2017-11-15 mer. 17:47] \\
  - Legendes en anglais
  
  Table 3.1 -> Table 1
:END:

#+LATEX: \rowcolors{2}{gray!25}{white}
#+NAME: code:table1
#+CAPTION: Copy of [[file:~/Projects/Thesis/MaThese/main.org::code:ewas_table_print][code:ewas_table_print]]
#+begin_src R  :results output latex :exports results
  library(xtable) ## https://cran.r-project.org/web/packages/xtable/vignettes/xtableGallery.pdf

  ewas.table <- readRDS("../MaThese/OUTPUT/Expr/ewas_table_toprint.rds")
  names(ewas.table) <- method_name(names(ewas.table))

  ewas.table %>%
    xtable(align = "lllllcccc",
           digits = -2, type = "latex",
           caption = "{\\bf Table1}",
           label = "table:ewas") %>%
    print(include.rownames=FALSE,
          sanitize.text.function=identity,
          floating.environment = "sidewaystable")

#+end_src

#+RESULTS: code:table1
#+BEGIN_EXPORT latex
% latex table generated in R 3.4.0 by xtable 1.8-2 package
% Wed Nov 15 18:00:05 2017
\begin{sidewaystable}[ht]
\centering
\begin{tabular}{llllcccc}
  \hline
ID & Chr & Position & Gene & pca & lfmm1 & cate & lfmm2 \\ 
  \hline
\textbf{cg16411857} & \textbf{16} & \textbf{57023191} & \textbf{NLRC5} & \textbf{9.2e-13} & \textbf{2.4e-12} & \textbf{6.6e-12} & \textbf{5.3e-12} \\ 
  \textbf{cg07839457} & \textbf{16} & \textbf{57023022} & \textbf{NLRC5} & \textbf{1.9e-11} & \textbf{4.5e-11} & \textbf{1.1e-10} & \textbf{9.7e-11} \\ 
  \textbf{cg05428452} & \textbf{6} & \textbf{32712979} & \textbf{HLA-DQA2} & \textbf{5.4e-11} & \textbf{4.6e-11} & \textbf{8.5e-11} & \textbf{8.8e-11} \\ 
  cg02508743 & 8 & 56903623 & LYN & 2.9e-08 & 2.7e-08 & 2.7e-08 & 2.8e-08 \\ 
  \textbf{cg20821042} & \textbf{6} & \textbf{32709158} & \textbf{HLA-DQA2} & \textbf{6.5e-08} & \textbf{6.1e-08} & \textbf{9.6e-08} & \textbf{1.0e-07} \\ 
  cg13081526 & 6 & 32449961 &  & 1.5e-07 & 1.2e-07 & 2.0e-07 & 2.2e-07 \\ 
  cg18052547 & 6 & 32552547 & HLA-DRB1 & 1.8e-07 & 1.8e-07 & 3.0e-07 & 3.1e-07 \\ 
  \textbf{cg25372449} & \textbf{6} & \textbf{32490350} & \textbf{HLA-DRB5} & \textbf{2.5e-07} & \textbf{2.6e-07} & \textbf{4.5e-07} & \textbf{4.6e-07} \\ 
  cg02030958 & 13 & 110386267 &  & 4.0e-07 & 7.8e-08 & 6.0e-08 & 1.1e-07 \\ 
  cg16171858 & 3 & 58472734 &  & 4.6e-07 & 1.6e-07 & 2.7e-08 & 3.8e-08 \\ 
  cg03280622 & 8 & 145023013 & PLEC1 & 4.7e-07 & 5.0e-09 & 5.8e-09 & 3.8e-08 \\ 
  cg24150157 & 19 & 51891210 & LIM2 & 6.2e-07 & 3.1e-07 & 1.6e-07 & 2.1e-07 \\ 
  cg26244575 & 12 & 76354015 &  & 6.9e-07 & 2.7e-09 & 5.0e-10 & 4.2e-09 \\ 
  cg05370853 & 6 & 32606634 & HLA-DQA1 & 7.1e-07 & 3.0e-07 & 3.3e-07 & 4.4e-07 \\ 
  cg14989316 & 10 & 80757927 & LOC283050 & 7.3e-07 & 6.1e-08 & 7.8e-08 & 2.1e-07 \\ 
  cg17360552 & 6 & 32725332 & HLA-DQB2 & 8.1e-07 & 6.1e-07 & 1.1e-06 & 1.2e-06 \\ 
  cg01373248 & 3 & 18480297 & SATB1 & 8.1e-07 & 1.4e-07 & 1.1e-07 & 2.5e-07 \\ 
  cg26164488 & 2 & 64440295 &  & 9.3e-07 & 3.5e-09 & 1.6e-09 & 1.4e-08 \\ 
  cg05874806 & 2 & 102350276 & MAP4K4 & 1.1e-06 & 1.1e-06 & 4.7e-07 & 5.6e-07 \\ 
   \hline
\end{tabular}
\caption{{\bf Table1}} 
\label{table:ewas}
\end{sidewaystable}
#+END_EXPORT

#+LATEX:\rowcolors{2}{}{}

** DONE Table2
CLOSED: [2017-11-15 mer. 18:45]
:LOGBOOK:
- State "DONE"       from              [2017-11-15 mer. 18:45]
- Note taken on [2017-11-15 mer. 17:48] \\
  - Legendes en anglais
  
  Table 3.2 -> Table 2
:END:

#+LATEX: \rowcolors{2}{gray!25}{white}
#+NAME: code:table2
#+CAPTION: Copy of [[file:~/Projects/Thesis/MaThese/main.org::code:gwas_table_print][code:gwas_table_print]] 
#+begin_src R :results output latex :exports results
  library(xtable)
  library(knitr)
  library(kableExtra)

  table.df <- readRDS("../MaThese/OUTPUT/Expr/gwas_table_toprint.rds")

  ## table.df %>% names() %>% paste0(collapse = "|")
  names(table.df)[5] <- "Odds ratio [$95\\%$ CI]"
  names(table.df)[6] <- "$p\\text{-value}$"
  names(table.df)[7] <- "$q\\text{-value}$"
  names(table.df)[8] <- "Gene"

  table.df %>%
    head(20) %>%
    dplyr::select(- `Position (pb)`) %>%
    xtable(align = "lllllccp{6cm}",
           type = "latex",
           label = "table:gwas_table",
           caption = "{\\bf Table2}") %>%
    print(include.rownames=FALSE,
          sanitize.colnames.function=identity,
          sanitize.text.function=identity,
          floating = TRUE,
          floating.environment = "sidewaystable"
          )
#+end_src

#+RESULTS: code:table2
#+BEGIN_EXPORT latex
% latex table generated in R 3.4.0 by xtable 1.8-2 package
% Wed Nov 15 18:07:27 2017
\begin{sidewaystable}[ht]
\centering
\begin{tabular}{llllccp{6cm}}
  \hline
Chr & Snp & LD block (Mb) & Odds ratio [$95\%$ CI] & $p\text{-value}$ & $q\text{-value}$ & Gene \\ 
  \hline
\textbf{3} & \textbf{rs1464510} & \textbf{189.56-189.61} & \textbf{1.30 [1.24-1.36]} & \textbf{3.8e-23} & \textbf{1.5e-20} & \textbf{LPP} \\ 
  \textbf{3} & \textbf{rs17810546} & \textbf{160.99-161.32} & \textbf{1.35 [1.26-1.45]} & \textbf{1.8e-16} & \textbf{6.1e-14} & \textbf{IQCJ-SCHIP1, IL12A-AS1, IL12A} \\ 
  \textbf{4} & \textbf{rs13151961} & \textbf{123.19-123.56} & \textbf{0.73 [0.68-0.78]} & \textbf{1.7e-14} & \textbf{5.3e-12} & \textbf{KIAA1109, ADAD1} \\ 
  \textbf{12} & \textbf{rs653178} & \textbf{110.25-110.49} & \textbf{1.22 [1.16-1.28]} & \textbf{6.8e-13} & \textbf{2.1e-10} & \textbf{CUX2, LINC02356, SH2B3, ATXN2} \\ 
  \textbf{2} & \textbf{rs917997} & \textbf{102.26-102.61} & \textbf{1.27 [1.20-1.35]} & \textbf{1.5e-12} & \textbf{4.6e-10} & \textbf{IL1RL1, IL18R1, IL18RAP, MIR4772, SLC9A4, SLC9A2} \\ 
  4 & rs6840978 & 123.73-123.77 & 0.77 [0.72-0.82] & 1.2e-11 & 3.5e-09 & IL21-AS1 \\ 
  3 & rs9811792 & 161.12-161.18 & 1.18 [1.12-1.24] & 6.6e-11 & 1.9e-08 & IL12A-AS1 \\ 
  \textbf{3} & \textbf{rs13098911} & \textbf{45.98-46.21} & \textbf{1.32 [1.22-1.43]} & \textbf{2.1e-10} & \textbf{5.8e-08} & \textbf{FYCO1, FLT1P1, CCR3} \\ 
  \textbf{1} & \textbf{rs2816316} & \textbf{190.77-190.80} & \textbf{0.78 [0.72-0.83]} & \textbf{2.2e-10} & \textbf{6.2e-08} & \textbf{} \\ 
  \textbf{3} & \textbf{rs6441961} & \textbf{46.26-46.33} & \textbf{1.21 [1.15-1.27]} & \textbf{1.7e-08} & \textbf{4.6e-06} & \textbf{CCR3, UQCRC2P1} \\ 
  \textbf{2} & \textbf{rs4675374} & \textbf{204.29-204.52} & \textbf{1.23 [1.16-1.31]} & \textbf{2.1e-07} & \textbf{5.4e-05} & \textbf{CD28, ICOS} \\ 
  2 & rs1018326 & 181.54-181.78 & 1.15 [1.10-1.21] & 4.4e-07 & 1.1e-04 & UBE2E3, LINC01934 \\ 
  3 & rs7648827 & 46.56-46.56 & 1.22 [1.12-1.33] & 4.6e-07 & 1.2e-04 & LRRC2 \\ 
  \textbf{2} & \textbf{rs13003464} & \textbf{60.95-61.24} & \textbf{1.19 [1.13-1.25]} & \textbf{5.0e-07} & \textbf{1.3e-04} & \textbf{LINC01185, REL, PUS10, RNA5SP95, KIAA1841, C2orf74} \\ 
  \textbf{10} & \textbf{rs1250552} & \textbf{80.71-80.74} & \textbf{0.84 [0.80-0.88]} & \textbf{5.2e-07} & \textbf{1.3e-04} & \textbf{ZMIZ1} \\ 
  3 & rs7629708 & 189.56-189.62 & 1.17 [1.11-1.24] & 1.0e-06 & 2.5e-04 & LPP \\ 
  \textbf{22} & \textbf{rs2298428} & \textbf{20.13-20.31} & \textbf{1.17 [1.10-1.24]} & \textbf{1.3e-06} & \textbf{3.3e-04} & \textbf{HIC2, UBE2L3, YDJC, CCDC116} \\ 
  18 & rs1394466 & 48.93-49.30 & 1.14 [1.08-1.20] & 1.5e-06 & 3.6e-04 & DCC \\ 
  \textbf{18} & \textbf{rs1893217} & \textbf{12.80-12.84} & \textbf{1.16 [1.08-1.23]} & \textbf{1.6e-06} & \textbf{4.0e-04} & \textbf{PTPN2} \\ 
  \textbf{1} & \textbf{rs864537} & \textbf{165.66-165.70} & \textbf{0.87 [0.83-0.92]} & \textbf{1.7e-06} & \textbf{4.2e-04} & \textbf{POU2F1, CD247} \\ 
   \hline
\end{tabular}
\caption{{\bf Table2}} 
\label{table:gwas_table}
\end{sidewaystable}
#+END_EXPORT

#+LATEX:\rowcolors{2}{}{}

** DONE TableS1
CLOSED: [2017-11-15 mer. 18:45]
:LOGBOOK:
- State "DONE"       from              [2017-11-15 mer. 18:45]
- Note taken on [2017-11-15 mer. 17:48] \\
  - Legendes en anglais
  
  Table 3.3 -> Table Sup 1
:END:

#+LATEX: \rowcolors{2}{gray!25}{white}
#+NAME: code:tableS1
#+CAPTION: Copy of [[file:~/Projects/Thesis/MaThese/main.org::code:geas_table_print][code:geas_table_print]]
#+begin_src R :results output latex :exports results
  library(xtable)
  library(knitr)
  library(kableExtra)
  library(stringr)

  table.df <- readRDS("../MaThese/OUTPUT/Expr/geas_table_toprint.rds")
  m <- table.df[,2]
  for (i in 1:nrow(m)) {
    m[i,1] <- sub(m[i, 1], pattern = "ridgeLFMM", replacement = "lfmm2")
    m[i,1] <- sub(m[i, 1], pattern = "lassoLFMM", replacement = "lfmm1")
  }
  table.df[,2] <- m
  names(table.df)[2] <- "Detected by methods"
  names(table.df)[3] <- "Phenotype description"



  ## table.df %>% names() %>% paste0(collapse = "|")
  table.df %>%
    xtable(align = "lp{4cm}ll", type = "latex", label = "table:geas",
           caption = "{\\bf TableS1}") %>%
    print(include.rownames=FALSE,
          sanitize.colnames.function=identity,
          sanitize.text.function=identity,
          floating = TRUE,
          floating.environment = "sidewaystable",
          )
#+end_src

#+RESULTS: code:tableS1
#+BEGIN_EXPORT latex
% latex table generated in R 3.4.0 by xtable 1.8-2 package
% Wed Nov 15 18:18:31 2017
\begin{sidewaystable}[ht]
\centering
\begin{tabular}{p{4cm}ll}
  \hline
SNPs & Detected by methods & Phenotype description \\ 
  \hline
rs10908907 & lfmm2, cate & Alcoholism (heaviness of drinking) \\ 
  rs10496731 & lfmm1 & Body Height \\ 
  rs2472297 & lfmm2, cate, lfmm1 & Caffeine metabolism \\ 
  rs2256175 & lfmm2, cate, lfmm1 & Cholesterol total \\ 
  rs2472297 & lfmm2, cate, lfmm1 & Coffee consumption (cups per day) \\ 
  rs2278544, rs2322659 & lfmm1 & Congenital lactase deficiency \\ 
  rs4954218 & lfmm2, cate, lfmm1 & Corneal structure \\ 
  rs882300 & lfmm2, cate, lfmm1 & Electrocardiographic traits \\ 
  rs882300 & lfmm2, cate, lfmm1 & Electrocardiography \\ 
  rs2256175 & lfmm2, cate, lfmm1 & Giant cell arteritis \\ 
  rs2256175, rs6085576, rs2104012, rs1983716, rs2853977 & lfmm2, cate, lfmm1 & Height \\ 
  rs6430549 & lfmm2, cate, lfmm1 & Hematocrit \\ 
  rs2278544, rs2322659 & lfmm1 & Lactose intolerance \\ 
  rs882300 & lfmm2, cate, lfmm1 & Multiple sclerosis \\ 
  rs1123848 & lfmm2, cate, lfmm1 & Neuroblastoma \\ 
  rs17158483 & lfmm1 & Obesity-related traits \\ 
   \hline
\end{tabular}
\caption{{\bf TableS1}} 
\label{table:geas}
\end{sidewaystable}
#+END_EXPORT

#+LATEX:\rowcolors{2}{}{}
